EDT/УТ/src/Documents/ОтражениеОплатыПоКомитентам/ОтражениеОплатыПоКомитентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтражениеОплатыПоКомитентам</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКомитентамиПоЗаказам</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКомитентами</registerRecords>
  <attributes>
    <name>ДокументПланируемыхПлатежей</name>
    <type>
      <types>DocumentRef.ПланируемыеПлатежиКомитентам</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПроведенныеПлатежи</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникДанных</name>
      <type>
        <types>CatalogRef.ИсточникиДанныхБазы1С</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлатежноеПоручение</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Выписка</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВыписки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыписки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВозникновенияЗадолженности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущееСостояниеВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПлатежногоДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлатежногоДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВозникновенияЗадолженности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтатьиРасчетов</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВозникновенияЗадолженности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасчетов</name>
      <type>
        <types>CatalogRef.СтатьиРасчетовСКомитентами</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/ВзаиморасчетыСКомитентами/ВзаиморасчетыСКомитентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКомитентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комитент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВозникновенияЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасчетовСКомитентами</name>
    <type>
      <types>CatalogRef.СтатьиРасчетовСКомитентами</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/AccumulationRegisters/ВзаиморасчетыСКомитентамиПоЗаказам/ВзаиморасчетыСКомитентамиПоЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКомитентамиПоЗаказам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комитент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВозникновенияЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Documents/ОтражениеОплатыПоКомитентам/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Задача № 2540
	ТаблицаДвиженийВзаиморасчетовСКомитентами = РегистрыНакопления.ВзаиморасчетыСКомитентами.ТаблицаДвиженийПоРегистру();
	//Задача № 2540
	
	Движения.ВзаиморасчетыСКомитентамиПоЗаказам.Записывать = Истина;
	Движения.ВзаиморасчетыСКомитентамиПоЗаказам.Очистить();
	Движения.ВзаиморасчетыСКомитентамиПоЗаказам.БлокироватьДляИзменения = Истина;
		
	//Для каждого ТекСтрока Из ПроведенныеПлатежи Цикл
	//	
	//	СтруктураОтбора = Новый Структура("Контрагент", Текстрока.Контрагент);
	//	
	//	НайденныеСтроки = Заказы.НайтиСтроки(СтруктураОтбора); 
	//	
	//	Для каждого СтрокаЗаказ Из НайденныеСтроки Цикл
	//		Запись = Движения.ВзаиморасчетыСКомитентамиПоЗаказам.ДобавитьРасход();
	//		Запись.Период = КонецДня(ТекСтрока.ДатаВыписки);
	//		Запись.Организация = ТекСтрока.Организация;
	//		Запись.Комитент = ТекСтрока.Контрагент;
	//		Запись.ДатаВозникновенияЗадолженности = ТекСтрока.ДатаВозникновенияЗадолженности;
	//		Запись.ТипЗаказа = СтрокаЗаказ.ТипЗаказа;
	//		Запись.Заказ = СтрокаЗаказ.Заказ;
	//		Запись.Сумма = СтрокаЗаказ.Сумма;
	//		
	//		//Задача № 2540
	//		ЗаполнитьЗначенияСвойств(ТаблицаДвиженийВзаиморасчетовСКомитентами.Добавить(),  Запись);
	//		//Задача № 2540

	//	КонецЦикла; 
	//	
	//КонецЦикла; 
	
	Для каждого ТекСтрока Из Заказы Цикл
		
		СтруктураОтбора = Новый Структура("Контрагент", ТекСтрока.Контрагент);
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ДатаВозникновенияЗадолженности) Тогда
			СтруктураОтбора.Вставить("ДатаВозникновенияЗадолженности", НачалоДня(ТекСтрока.Заказ.Дата));
		Иначе
			СтруктураОтбора.Вставить("ДатаВозникновенияЗадолженности", ТекСтрока.ДатаВозникновенияЗадолженности);			
		КонецЕсли; 
		
		НайденныеСтроки = ПроведенныеПлатежи.НайтиСтроки(СтруктураОтбора);
		
		Для каждого СтрокаВыписка Из НайденныеСтроки Цикл
		
			Запись = Движения.ВзаиморасчетыСКомитентамиПоЗаказам.ДобавитьРасход();
			Запись.Период = КонецДня(СтрокаВыписка.ДатаВыписки);
			Запись.Организация = СтрокаВыписка.Организация;
			Запись.Комитент = ТекСтрока.Контрагент;
			Запись.ДатаВозникновенияЗадолженности = СтрокаВыписка.ДатаВозникновенияЗадолженности;
			Запись.ТипЗаказа = ТекСтрока.ТипЗаказа;
			Запись.Заказ = ТекСтрока.Заказ;
			Запись.Сумма = ТекСтрока.Сумма;
		
		КонецЦикла; 
		
		//Задача № 2540
		ЗаполнитьЗначенияСвойств(ТаблицаДвиженийВзаиморасчетовСКомитентами.Добавить(),  Запись);
		//Задача № 2540
		
	КонецЦикла; 
	
	//Задача № 2540
	Движения.ВзаиморасчетыСКомитентами.СоздатьДвижения(ЭтотОбъект, ТаблицаДвиженийВзаиморасчетовСКомитентами);
	//Задача № 2540

КонецПроцедуры
